import java.util.Random;

public class WordGenerator {
    private String[] words = {"собака", "кіт", "восьминіг", "носоріг", "кінь", "орел", "білка",
            "сова", "дельфін", "кашалот", "пінгвін", "скорпіон", "ігуана", "лемур",
            "тигр", "слон", "жирафа", "вовк", "лисиця", "лев", "зебра", "мураха",
            "комар", "кролик", "шакал", "ведмідь", "крокодил", "гепард", "єнот",
            "панда", "бегемот", "змія", "кабан", "лисиця",  "черепаха", "оса",
            "шершень", "буйвол", "бобер", "страус", "пелікан", "куниця",
            "козел", "баран"};
    private Random random;

    public WordGenerator() {
        random = new Random();
    }

    public String getRandomWord() {
        return words[random.nextInt(words.length)];
    }
}
